# ColorTemperature Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..ColorTemperature Property
SpecTypeId Class See Also
---
Color Temperature, in discipline Electrical.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId ColorTemperature { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColorTemperature As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ColorTemperature {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace